src/Services/Air/templates/AIR_FLIGHT_INFORMATION_REQUEST.xml

<soapenv:Envelope
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:air="http://www.travelport.com/schema/air_v35_0"
    xmlns:com="http://www.travelport.com/schema/common_v35_0">
    <soapenv:Header/>
    <soapenv:Body>
        <air:FlightInformationReq TargetBranch="{{TargetBranch}}">
            <com:BillingPointOfSaleInfo OriginApplication="uAPI"/>
            {{#flightInfoCriteria}}
            <air:FlightInfoCriteria
                Carrier="{{airline}}"
                DepartureDate="{{departure}}"
                FlightNumber="{{flightNumber}}"
                Key=""
            />
            {{/flightInfoCriteria}}
            {{#if overridePcc}}
            <com:OverridePCC ProviderCode="1G" PseudoCityCode="{{overridePcc}}"/>
            {{/if}}
        </air:FlightInformationReq>
    </soapenv:Body>
</soapenv:Envelope>
